emacs.org
#+title Emacs Configration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: fold


emacsのinit.elをorg-modeを使って管理する. saveすると自動的にemacs-lisp code block内のコードがinit.elにinit.elが生成される. 


* Packege System

** General

   パッケージをリポジトリに追加する.
   
   #+begin_src emacs-lisp
    ;; init.el is created from emacs.org which emacs settings.
    ;; Do NOT modify this file.

    ;; Initialize package sources
    (require 'package)

    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
				 ("melpa-stable" . "https://stable.melpa.org/packages/")
				 ("org" . "https://orgmode.org/elpa/")
				 ("elpa" . "https://elpa.gnu.org/packages/")))

    (package-initialize)
    (unless package-archive-contents
	  (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms
    (unless  (package-installed-p 'use-package)
      (package-install 'use-package))


   #+end_src

   
*** [[https://github.com/jwiegley/use-package][use-packege]]

    パッケージの使用を可読性高く書くことができるマクロ. [[https://github.com/conao3/leaf.el][leaf]]というuse-packageの代替パッケージが存在する. こっちの方がモダンかも.
    
  #+begin_src emacs-lisp
    (require 'use-package)
  #+end_src
   
**** usage
     (require 'パッケージ名)の代わりに(use-package パッケージ名)でパッケージを使うことができる. キーワード引数使うこともできる. 
     
     :init is executed before a package is loaded.
     :config is executed after apackage is loaded.
     :bind defines key-bindngs.
     :bind-keymap
     :mode
     :defer
     :interpreter
     :magic
     :hook
     :commands
     :custom allows customazation of packegee custom variables.
     :custom-face
     :if
     :endure
     :after
     :load-path
     :requires
     :no-require
     :defines

     
***** fast startup
      requireでpackageを使う場合autoloadで遅延ロードできる. use-packageの場合は:commands, :bind, :mode, :interpreter, :deferで設定される項目が遅延ロードされる. 
      
**** others
  #+begin_src emacs-lisp

    ;; On non-Guix systems, "ensure" packages by default
    (setq use-package-always-ensure t)
    (use-package quelpa)

    (use-package no-littering)

    ;; no-littering doesn't set this by default so we must place
    ;; auto save files in the same path as it uses for sessions
    (setq auto-save-file-name-transforms
	  `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  #+end_src

  
** Package Updates

   #+begin_src emacs-lisp
     (use-package auto-package-update
       :custom
       (auto-package-update-interval 7)
       (auto-package-update-prompt-before-update t)
       (auto-package-update-hide-results t)
       :config
       (auto-package-update-maybe)
       (auto-package-update-at-time "09:00"))
   #+end_src

** Shell Path
   emacs does not load shell path by default.
   #+begin_src emacs-lisp
     (use-package exec-path-from-shell
       :config
       (exec-path-from-shell-initialize))
   #+end_src
   

* Emacs General Settings
  
** UI
   
  #+begin_src emacs-lisp
    ;; Thanks, but no thanks
    (setq inhibit-startup-message t)

    ;;(scroll-bar-mode -1)        ; Disable visible scrollbar
    (tool-bar-mode -1)          ; Disable the toolbar
    (tooltip-mode -1)           ; Disable tooltips
    (set-fringe-mode 10)       ; Give some breathing room
    (menu-bar-mode -1)            ; Disable the menu bar

    ;; Set up the visible bell
    (setq visible-bell t)

    ;; show line numb
    (column-number-mode)
    (global-display-line-numbers-mode t)

    ;; Override some modes which derive from the above
    (dolist (mode '(org-mode-hook
		    shell-mode-hook
		    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))

  #+end_src

** Keybinding

   #+begin_src emacs-lisp

     ;;ESC Cancels All
     (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

     (use-package general
       :config
       (general-create-definer rune/leader-keys
	 :keymaps '(normal insert visual emacs)
	 :prefix "SPC"
	 :global-prefix "C-SPC")

       ;; (leader-keys
       ;; 	 "t" '(:ignore t :which-key "toggles")
       ;; 	 "tt" '(counsel-load-theme :which-key "choose theme")))


           (global-set-key (kbd "C-M-j") 'counsel-switch-buffer))

   #+end_src
  
** Theme
   
  #+begin_src emacs-lisp

    (use-package doom-themes
      :config
      (load-theme 'doom-dracula t))

    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))
  #+end_src

** Modeline
   
  #+begin_src emacs-lisp
     (use-package all-the-icons)

	  (use-package doom-modeline
	    :ensure t
	    :init (doom-modeline-mode 1)
	    :custom ((doom-modeline-hight 15))
	    )

  #+end_src

** Which Kye
   
   #+begin_src emacs-lisp
     (use-package which-key
       :init (which-key-mode)
       :diminish which-key-mode
       :config
       (setq which-key-idle-delay 0.3))

   #+end_src

** Ivy

   #+begin_src emacs-lisp

     (use-package ivy
       :diminish
       :bind (("C-s" . swiper)
	      :map ivy-minibuffer-map
	      ("TAB" . ivy-alt-done)
	      ("C-f" . ivy-alt-done)
	      ("C-l" . ivy-alt-done)
	      ("C-j" . ivy-next-line)
	      ("C-k" . ivy-previous-line)
	      :map ivy-switch-buffer-map
	      ("C-k" . ivy-previous-line)
	      ("C-l" . ivy-done)
	      ("C-d" . ivy-switch-buffer-kill)
	      :map ivy-reverse-i-search-map
	      ("C-k" . ivy-previous-line)
	      ("C-d" . ivy-reverse-i-search-kill))
       :config
       (ivy-mode t))

     (use-package ivy-rich
       :init
       (ivy-rich-mode 1)
       )
   #+end_src

** Counsel
   #+begin_src emacs-lisp

     (use-package counsel
     :init
     (setq-default dired-omit-files-p t)
     (setq dired-omit-files "^\\.DS_Store")
     (setq counsel-find-file-ignore-regexp (regexp-opt '(".DS_Store")))
     
     :bind (
     ("M-x" . counsel-M-x)
     ("C-x b" . counsel-ibuffer)
     ("C-x C-f" . counsel-find-file)
     ;; ("C-M-j" . counsel-switch-buffer)
     ("C-M-l" . counsel-imenu)
     :map minibuffer-local-map
     ("C-r" . 'counsel-minibuffer-history))
     )
   #+end_src


  
** Dired

   #+begin_src emacs-lisp
     (use-package dired			
       :ensure nil
       :commands (dired dired-jump)
       :bind (("C-x C-j" . dired-jump))
       :config
       ;; (evil-collection-define-key 'normal 'dired-mode-map
       ;;   "h" 'dired-up-directory
       ;;   "l" 'dired-find-file)
       )

   #+end_src
   
** Helpful

   #+begin_src emacs-lisp

     (use-package helpful
       :custom
       (counsel-describe-function-function #'helpful-callable)
       (counsel-describe-variable-function #'helpful-variable)
       :bind
       ([remap describe-function] . helpful-function)
       ([remap describe-symbol] . helpful-symbol)
       ([remap describe-variable] . helpful-variable)
       ([remap describe-command] . helpful-command)
       ([remap describe-key] . helpful-key))


   #+end_src

** Text Scalling

   #+begin_src emacs-lisp

     (use-package hydra)

     ;; (defhydra hydra-text-scale (:timeout 4)
     ;;   ("j" text-scale-increase "in")
     ;;   ("k" text-scale-decrease "out")
     ;;   ("f" nil "finished" :exit t)
     ;;   )

     ;; (rune/leader-keys
     ;;   "ts" '(hydra-text-scale/body :which-key "scale text"))
   #+end_src
 
** Font
   
  #+begin_src emacs-lisp

    ;; font setting
    ;;(set-face-attribute 'default nil :font "Fira Mono" :height 280)
    ;;(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 295 :wigth 'regular)
    (set-face-attribute 'default nil :height 150)
   #+end_src

