emacs.org
** Evil

  #+begin_src emacs-lisp

    (use-package evil
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      ;; (setq evil-want-C-u-scroll t)
      (setq evil-want-C-i-jump nil)
      ;; cursor colors
      (setq evil-normal-state-cursor '("cyan" box)) 
      (setq evil-emacs-state-cursor '("orange" box))

      :config
      (evil-mode 1)
      (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

      ;; global  
      ;; Use visual line motions even outside of visual-line-mode buffers
      ;; (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      ;; (evil-global-set-key 'motion "k" 'evil-previous-visual-line)


      ;; emacs state
      (define-key evil-emacs-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
      (define-key evil-emacs-state-map (kbd "<escape>") 'evil-normal-state)

      ;; normal state
      ;; C-f, C-b, C-n,C-p bindings in normal state
      (define-key evil-normal-state-map (kbd "C-f") 'evil-forward-char) ; C-f is evil-scroll-page-down by default
      (define-key evil-normal-state-map (kbd "C-b") 'evil-backward-char) ; C-b is evil-scroll-page-up by default
      (define-key evil-normal-state-map (kbd "C-n") 'evil-next-visual-line) ; C-n is evil-paste-pop-next by default
      (define-key evil-normal-state-map (kbd "C-p") 'evil-previous-visual-line) ; C-p is evil-paste-pop  by default
      (setq-default evil-cross-lines t) ; Make horizontal movement cross lines

      ;; visual state
      (define-key evil-visual-state-map (kbd "C-f") 'evil-forward-char) ; C-f is evil-scroll-page-down by default
      (define-key evil-visual-state-map (kbd "C-b") 'evil-backward-char) ; C-b is evil-scroll-page-up by default
      (define-key evil-visual-state-map (kbd "C-n") 'evil-next-visual-line) ; C-n is evil-paste-pop-next by default
      (define-key evil-visual-state-map (kbd "C-p") 'evil-previous-visual-line) ; C-p is evil-paste-pop  by default

      (evil-set-initial-state 'messages-buffer-mode 'normal)
      (evil-set-initial-state 'dashboard-mode 'normal))


    (defalias 'evil-insert-state 'evil-emacs-state)


    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))
  #+end_src


* Org
  
** Visual Settings

  #+begin_src emacs-lisp

    (use-package org
      ;;  hook (org-mode . dw/org-mode-setup)
      :config
      (org-indent-mode)
      (variable-pitch-mode 1)
      (auto-fill-mode 0)
      (visual-line-mode 1)

      (setq org-startup-truncated nil)
      (setq evil-auto-indent nil)
      (setq org-ellipsis " ▾"
	    org-hide-emphasis-markers t)
      )

    (use-package org-bullets
      :after org
      :hook (org-mode . org-bullets-mode)
      :custom
      (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
			    '(("^ *\\([-]\\) "
			      (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    (dolist (face '((org-level-1 . 1.2)
		    (org-level-2 . 1.1)
		    (org-level-3 . 1.05)
		    (org-level-4 . 1.0)
		    (org-level-5 . 1.1)
		    (org-level-6 . 1.1)
		    (org-level-7 . 1.1)
		    (org-level-8 . 1.1)))
      ;;(set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face))
      )

    ;; Make sure org-indent face is available
    (require 'org-indent)

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  #+end_src

** Org Babel
   
*** Babel Languages
   
  #+begin_src emacs-lisp
	(with-eval-after-load 'org
	    (org-babel-do-load-languages
	     'org-babel-load-languages
	     '((emacs-lisp . t)
	       (python . t)
	       (shell . t)
	       (lisp . t)
	       (jupyter . t)
	       )
	     )
	(add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
	    )

	(setq org-confirm-babel-evaluate nil)
  #+end_src



*** Structure Templates
    
  #+begin_src emacs-lisp
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("jl" . "src julia"))
    (add-to-list 'org-structure-template-alist '("cl" . "src lisp"))
  #+end_src

** Auto tangle
   
  #+begin_src emacs-lisp
    ;; Automatically tangle our Emacs.org config file when we save it
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (file-name-directory (buffer-file-name))
			  (expand-file-name user-emacs-directory))
	;; Dynamic scoping to the rescue
	(let ((org-confirm-babel-evaluate nil))
	  (org-babel-tangle))))

    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

 #+end_src


* Develepment

** General

*** Language Server Protcol

   #+begin_src emacs-lisp
     (use-package lsp-mode
       :commands (lsp lsp-deferred)
       :init
       (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
       :config
       (lsp-enable-which-key-integration t))
   #+end_src

*** Header Breadcrumb
   #+begin_src emacs-lisp
     (defun lsp-mode-setup ()
       (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
       (lsp-headerline-breadcrumb-mode)

     :hook (lsp-mode . lsp-mode-setup)
     )
   #+end_src

*** Better Completions with company-mode
    #+begin_src emacs-lisp
      (use-package company
	:after lsp-mode
	:hook (prog-mode . company-mode)
	:bind (:map company-active-map
	       ("C-f" . company-complete-selection))
	      (:map lsp-mode-map
	       ("<tab>" . company-indent-or-complete-common))
	:custom
	(company-minimum-prefix-length 1)
	(company-idle-delay 0.0))

      (use-package company-box
	:hook (company-mode . company-box-mode))

    #+end_src


*** More UI Enhancements lsp-ui-mode
   Enable nice rendering of documentation on hover
   Warning: on some systems this package can reduce your emacs responsiveness significally.
   (See: https://emacs-lsp.github.io/lsp-mode/page/performance/)
   In that case you have to not only disable this but also remove from the packages since
   lsp-mode can activate it automatically.
    #+begin_src emacs-lisp
      (use-package lsp-ui
	:hook (lsp-mode . lsp-ui-mode))
    #+end_src

*** Sideline
    #+begin_src emacs-lisp
      (setq lsp-ui-sideline-enable nil)
      (setq lsp-ui-sideline-show-hover nil)
    #+end_src

*** lsp-treemacs
    #+begin_src emacs-lisp
      (use-package lsp-treemacs
	:after lsp)
    #+end_src

*** Quicker symbol searching with lsp-ivy
    #+begin_src emacs-lisp
      (use-package lsp-ivy)
    #+end_src

*** Commenting lines

    #+begin_src emacs-lisp
      (use-package evil-nerd-commenter
	:bind ("M-/" . evilnc-comment-or-uncomment-lines))
    #+end_src
    
** Languages
   
*** Python

    #+begin_src emacs-lisp
      (use-package python-mode
		  :ensure t
		  :hook (python-mode . lsp-deferred)
		  :custom
		  (python-shell-interpreter "python3"))
    #+end_src

*** Python-docker
    #+begin_src emacs-lisp
      (use-package lsp-docker
	:custom
	(defvar lsp-docker-client-packages '(lsp-clients lsp-bash lsp-pyls))

	(setq lsp-docker-client-configs
	      '((:server-id bash-ls :docker-server-id bashls-docker :server-command "bash-language-server start")
		(:server-id dockerfile-ls :docker-server-id dockerfilels-docker :server-command "docker-langserver --stdio")
		(:server-id pyls :docker-server-id pyls-docker :server-command "pyls")
		))

	(lsp-docker-init-clients
	 :path-mappings '(("path-to-projects-you-want-to-use" . "/projects"))
	 :client-packages lsp-docker-client-packages
	 :client-configs lsp-docker-client-configs)
	)

    #+end_src




