emacs.org
*** Julia

    #+begin_src emacs-lisp
      ;; (set-language-environment "UTF-8")

      ;; (require 'eglot)
      ;; (add-hook 'julia-mode-hook 'eglot-ensure)

      ;; (require 'julia-mode)
      ;; (require 'julia-repl)
      ;; (add-hook 'julia-mode-hook 'julia-repl-mode)
      ;; (add-to-list 'eglot-server-programs
      ;;              '(julia-mode . ("julia" "-e using LanguageServer, LanguageServer.SymbolServer; runserver()")))
    #+end_src


    #+begin_src emacs-lisp
      (use-package eglot)
      (add-hook 'julia-mode-hook 'eglot-ensure)
      (use-package julia-mode)
      (require 'julia-repl)
      (add-hook 'julia-mode-hook 'julia-repl-mode)
      (add-to-list 'eglot-server-programs
		   '(julia-mode . ("julia" "-e using LanguageServer, LanguageServer.SymbolServer; runserver()")))
    #+end_src


    
     # #+begin_src emacs-lisp
     #   (use-package lsp-julia
     # 	       :config
     # 	       (setq lsp-julia-default-environment "~/.julia/environments/v1.7"))

     #   (add-hook 'ess-julia-mode-hook #'lsp-mode)
     # #+end_src


    
*** Go
    #+begin_src emacs-lisp
      (use-package go-mode)
    #+end_src

*** Common Lisp
    
    #+begin_src emacs-lisp
      (use-package slime
	:config
	(setq inferior-lisp-program "clisp")
	(setq slime-net-coding-system 'utf-8-unix)
	)
    #+end_src



*** Scala
**** scala-mode for highlighting, indentation and motion commands    
    #+begin_src emacs-lisp
      
      (use-package scala-mode
	:interpreter
	  ("scala" . scala-mode))
    #+end_src

**** Enable sbt mode for executing sbt commands
   #+begin_src emacs-lisp
     (use-package sbt-mode
       :commands sbt-start sbt-command
       :config
       ;; WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31
       ;; allows using SPACE when in the minibuffer
       (substitute-key-definition
	'minibuffer-complete-word
	'self-insert-command
	minibuffer-local-completion-map)
	;; sbt-supershell kills sbt-mode:  https://github.com/hvesalai/emacs-sbt-mode/issues/152
	(setq sbt:program-options '("-Dsbt.supershell=false"))
     )
   #+end_src


**** metals backend for lsp-mode


	    (use-package lsp-metals
	      :ensure t
	      :custom
	      ;; Metals claims to support range formatting by default but it supports range
	      ;; formatting of multiline strings only. You might want to disable it so that
	      ;; emacs can use indentation provided by scala-mode.
	      (lsp-metals-server-args '("-J-Dmetals.allow-multiline-string-formatting=off"))
	      :hook (scala-mode . lsp)
	      )







   
*** yaml
    #+begin_src emacs-lisp
      (use-package yaml-mode)
    #+end_src




*** SQL
    
    require pgformatter. To install it, run next.
    
    #+begin_src shell
      brew install pgformatter
    #+end_src

    
    #+begin_src emacs-lisp
      (use-package sqlformat)
      (setq sqlformat-command 'pgformatter)
      (setq sqlformat-args '("-s2" "-g"))
    #+end_src


*** Markdown
    #+begin_src emacs-lisp
      (use-package markdown-mode
	:ensure t
	:commands (markdown-mode gfm-mode)
	:mode (("README\\.md\\'" . gfm-mode)
	       ("\\.md\\'" . markdown-mode)
	       ("\\.markdown\\'" . markdown-mode))
	:init (setq markdown-command "multimarkdown"))

      (use-package markdown-preview-mode)
    #+end_src




*** Jupyter
    #+begin_src emacs-lisp
	    (use-package jupyter)
    #+end_src




    

    
*** CSV
    
    #+begin_src emacs-lisp
      (use-package csv-mode)
    #+end_src


*** digdag
    #+begin_src emacs-lisp
      (use-package digdag-mode)
    #+end_src

*** Tex

    #+begin_src emacs-lisp
(autoload 'yatex-mode "yatex" "Yet Another LaTeX mode" t)
(setq auto-mode-alist
      (append '(("\\.tex$" . yatex-mode)
                ("\\.ltx$" . yatex-mode)
                ("\\.cls$" . yatex-mode)
                ("\\.sty$" . yatex-mode)
                ("\\.clo$" . yatex-mode)
                ("\\.bbl$" . yatex-mode)) auto-mode-alist))

(setq YaTeX-inhibit-prefix-letter t)
(setq YaTeX-kanji-code nil)
(setq YaTeX-latex-message-code 'utf-8)
(setq YaTeX-use-LaTeX2e t)
(setq YaTeX-use-AMS-LaTeX t)
(setq YaTeX-dvi2-command-ext-alist
      '(("Preview\\|TeXShop\\|TeXworks\\|Skim\\|mupdf\\|xpdf\\|Firefox\\|Adobe" . ".pdf")))

(setq tex-command "/Library/TeX/texbin/ptex2pdf -u -l -ot '-synctex=1'");uplatex

;(setq tex-command "/Library/TeX/texbin/ptex2pdf -l -ot '-synctex=1'");platex
;(setq tex-command "/Library/TeX/texbin/platex");platex

;(setq tex-command "xelatex -synctex=1");XeLatexでコンパイル
;(setq tex-command "/Library/TeX/texbin/latex");latex

;(setq bibtex-command "/Library/TeX/texbin/latexmk -e '$latex=q/uplatex %O -synctex=1 %S/' -e '$bibtex=q/upbibtex %O %B/' -e '$biber=q/biber %O --bblencoding=utf8 -u -U --output_safechars %B/' -e '$makeindex=q/upmendex %O -o %D %S/' -e '$dvipdf=q/dvipdfmx %O -o %D %S/' -norc -gg -pdfdvi")
(setq bibtex-command (cond ((string-match "uplatex\\|-u" tex-command) "/Library/TeX/texbin/upbibtex")((string-match "platex" tex-command) "/Library/TeX/texbin/pbibtex")((string-match "lualatex\\|luajitlatex\\|xelatex" tex-command) "/Library/TeX/texbin/bibtexu")((string-match "pdflatex\\|latex" tex-command) "/Library/TeX/texbin/bibtex")(t "/Library/TeX/texbin/pbibtex")))


(setq makeindex-command (cond ((string-match "uplatex\\|-u" tex-command) "/Library/TeX/texbin/mendex")
			      ((string-match "platex" tex-command) "/Library/TeX/texbin/mendex")
			      ((string-match "lualatex\\|luajitlatex\\|xelatex" tex-command) "/Library/TeX/texbin/texindy")
			      ((string-match "pdflatex\\|latex" tex-command) "/Library/TeX/texbin/makeindex")
			      (t "/Library/TeX/texbin/mendex")))
  ;; (setq dvi2-command "/usr/bin/open -a Preview")
(setq dvi2-command "/usr/bin/open -a Skim")
(setq tex-pdfview-command "/usr/bin/open -a Skim")
(setq dviprint-command-format "/usr/bin/open -a \"Adobe Acrobat Reader DC\" `echo %s | gsed -e \"s/\\.[^.]*$/\\.pdf/\"`")

  (auto-fill-mode -1)
    #+end_src



 


*** terraform
    #+begin_src emacs-lisp
	    (use-package terraform-mode
	:hook (terraform-mode-hook . #'terraform-format-on-save-mode)
      )
    #+end_src


 

 

    
** Docker
**** [[https://github.com/Silex/docker.el][docker]]
     Emacs integration for docker, wheich run docker command from emacs.
     
     #+begin_src emacs-lisp
       (use-package docker
	 :ensure t
	 :bind ("C-c d" . docker))
     #+end_src


     
**** [[https://github.com/spotify/dockerfile-mode][dockerfile-mode]]
     
    #+begin_src emacs-lisp
    (use-package dockerfile-mode)
    #+end_src

**** docker 

** Projectile

   #+begin_src emacs-lisp

	  (use-package projectile
	    :diminish projectile-mode
	    :config (projectile-mode)
	    :custom ((projectile-completion-system 'ivy))
	    :bind-keymap
	    ("C-c p" . projectile-command-map)
	    :init
	    (when (file-directory-p "~/projects/code")
	      (setq projectile-project-search-path '("~/projects/code")))
	    (setq projectile-switch-project-action #'projectile-dired))

	  (use-package counsel-projectile
	    :config (counsel-projectile-mode))
   #+end_src   
  
** Terminals

*** term-mode
    
    #+begin_src emacs-lisp
      (use-package term
	:config
	(setq explicit-shell-file-name "zsh")
	;;(setq explicit-zsh-args '())
	(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
    #+end_src

*** For batter color support
    
    #+begin_src emacs-lisp
      (use-package eterm-256color
	:hook (term-mode . eterm-256color-mode))
    #+end_src

** [[https://github.com/magit/magit][Magit]]
   git interface.
   #+begin_src emacs-lisp
     (use-package magit
       :commands (magit-status magit-get-current-branch)
       :custom
       (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
   #+end_src
   
   
   
